In this folder there is hirng.csv. This file contains hiring statics for a such as experience of candidate, his written test score and personal interview score, Based on these 3 factor, HR will decide the salary. Given this data, you need to build a machine learning model for HR department that can help them decide for future candidates. Using this predict salaries candidates

1) 2yr experience, 9 test score, 6 interview score
2) 12yr experience, 10 test score, 10 interview, 10 interview score

Answer : 
1) 53713.866
2) 93747.796

In [32]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import math

In [33]:
df = pd.read_csv('hiring.csv')

In [34]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
experience                    6 non-null object
test_score(out of 10)         7 non-null float64
interview_score(out of 10)    8 non-null int64
salary($)                     8 non-null int64
dtypes: float64(1), int64(2), object(1)
memory usage: 336.0+ bytes

In [50]:
df['experience'].fillna('zero', inplace=True)

In [37]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [38]:
#import word2number as w2n
from word2number import w2n

In [39]:
#converting string format number to integer number
df['experience'] = df['experience'].apply(w2n.word_to_num)

In [40]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [41]:
#filling 'test_score(out of 10)' column NAN value with mean
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna(math.floor(df['test_score(out of 10)'].mean()))

In [42]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [43]:
x = df.iloc[:,0:3]
y = df.iloc[:,-1:]

In [44]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()
model.fit(x,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [45]:
#1) 2yr experience, 9 test score, 6 interview score
model.predict([[2,9,6]])

array([[53713.86677124]])

In [49]:
#2) 12yr experience, 10 test score, 10 interview, 10 interview score
model.predict([[12,10,10]])

array([[93747.79628651]])

In [47]:
model.score(x,y)

0.9770139014273139

In [48]:
from sklearn.metrics import r2_score
r2_score(y,model.predict(x))

0.9770139014273139